.sbom/pipdeptree.3.11.mermaid
flowchart TD
    classDef missing stroke-dasharray: 5
    alembic["alembic\n1.17.0"]
    annotated-types["annotated-types\n0.7.0"]
    antlr4-python3-runtime["antlr4-python3-runtime\n4.13.2"]
    argcomplete["argcomplete\n3.6.3"]
    arrow["arrow\n1.4.0"]
    attrs["attrs\n25.4.0"]
    boolean-py["boolean.py\n5.0"]
    certifi["certifi\n2025.10.5"]
    chardet["chardet\n5.2.0"]
    charset-normalizer["charset-normalizer\n3.4.4"]
    click_0["click\n8.3.0"]
    coloredlogs["coloredlogs\n14.0"]
    colorlog["colorlog\n6.10.1"]
    cyclonedx-bom["cyclonedx-bom\n7.2.0"]
    cyclonedx-python-lib["cyclonedx-python-lib\n11.4.0"]
    dagster-pipes["dagster-pipes\n1.9.11"]
    dagster-postgres["dagster-postgres\n0.25.11"]
    dagster["dagster\n1.9.11"]
    defusedxml["defusedxml\n0.7.1"]
    dependency-groups["dependency-groups\n1.3.1"]
    distlib["distlib\n0.4.0"]
    docker-compose-graph["docker-compose-graph\n1.0.0"]
    docker["docker\n7.1.0"]
    docstring-parser["docstring_parser\n0.17.0"]
    dotenv["dotenv\n0.9.9"]
    filelock["filelock\n3.20.0"]
    fqdn["fqdn\n1.5.1"]
    fsspec["fsspec\n2025.9.0"]
    gitdb["gitdb\n4.0.12"]
    gitpython["GitPython\n3.1.45"]
    graphviz["graphviz\n0.21"]
    greenlet["greenlet\n3.2.4"]
    grpcio-health-checking["grpcio-health-checking\n1.71.2"]
    grpcio["grpcio\n1.76.0"]
    humanfriendly["humanfriendly\n10.0"]
    humanize["humanize\n4.14.0"]
    idna["idna\n3.11"]
    isoduration["isoduration\n20.11.0"]
    jinja2["Jinja2\n3.1.6"]
    jsonpointer["jsonpointer\n3.0.0"]
    jsonschema-specifications["jsonschema-specifications\n2025.9.1"]
    jsonschema["jsonschema\n4.25.1"]
    lark["lark\n1.3.0"]
    license-expression["license-expression\n30.4.4"]
    lxml["lxml\n6.0.2"]
    mako["Mako\n1.3.10"]
    markdown-it-py["markdown-it-py\n4.0.0"]
    markupsafe["MarkupSafe\n3.0.3"]
    mdurl["mdurl\n0.1.2"]
    nox["nox\n2025.10.16"]
    openstudiolandscapes-twingate["OpenStudioLandscapes-Twingate\n0.0.0"]
    openstudiolandscapes["OpenStudioLandscapes\n0.0.0"]
    openstudiolandscapesutil-harborcli["OpenStudioLandscapesUtil-HarborCLI\n0.0.0"]
    packageurl-python["packageurl-python\n0.17.5"]
    packaging["packaging\n25.0"]
    pathlib-abc["pathlib_abc\n0.5.2"]
    pip-requirements-parser["pip-requirements-parser\n32.0.1"]
    pip["pip\n25.3"]
    pipdeptree["pipdeptree\n2.29.0"]
    platformdirs["platformdirs\n4.5.0"]
    protobuf["protobuf\n5.29.5"]
    psycopg2-binary["psycopg2-binary\n2.9.11"]
    py-serializable["py-serializable\n2.1.0"]
    pydantic-core["pydantic_core\n2.41.4"]
    pydantic["pydantic\n2.12.3"]
    pydot["pydot\n4.0.1"]
    pygments["Pygments\n2.19.2"]
    pyparsing["pyparsing\n3.2.5"]
    python-dateutil["python-dateutil\n2.9.0.post0"]
    python-dotenv["python-dotenv\n1.1.1"]
    pytz["pytz\n2025.2"]
    pyyaml["PyYAML\n6.0.3"]
    referencing["referencing\n0.37.0"]
    requests["requests\n2.32.5"]
    rfc3339-validator["rfc3339-validator\n0.1.4"]
    rfc3986-validator["rfc3986-validator\n0.1.1"]
    rfc3987-syntax["rfc3987-syntax\n1.1.0"]
    rich["rich\n14.2.0"]
    rpds-py["rpds-py\n0.28.0"]
    setuptools["setuptools\n80.9.0"]
    six["six\n1.17.0"]
    smmap["smmap\n5.0.2"]
    snakemd["snakemd\n2.3.0"]
    sortedcontainers["sortedcontainers\n2.4.0"]
    sqlalchemy["SQLAlchemy\n2.0.44"]
    structlog["structlog\n25.4.0"]
    tabulate["tabulate\n0.9.0"]
    tomli["tomli\n2.3.0"]
    toposort["toposort\n1.10"]
    tqdm["tqdm\n4.67.1"]
    typing-extensions["typing_extensions\n4.15.0"]
    typing-inspection["typing-inspection\n0.4.2"]
    tzdata["tzdata\n2025.2"]
    universal-pathlib["universal_pathlib\n0.3.4"]
    uri-template["uri-template\n1.3.0"]
    urllib3["urllib3\n2.5.0"]
    virtualenv["virtualenv\n20.35.3"]
    watchdog["watchdog\n5.0.3"]
    webcolors["webcolors\n24.11.1"]
    alembic -- ">=1.4.0" --> sqlalchemy
    alembic -- ">=4.12" --> typing-extensions
    alembic -- "any" --> mako
    arrow -- ">=2.7.0" --> python-dateutil
    arrow -- "any" --> tzdata
    coloredlogs -- ">=7.1" --> humanfriendly
    cyclonedx-bom -- ">=0.11,<2" --> packageurl-python
    cyclonedx-bom -- ">=22,<26" --> packaging
    cyclonedx-bom -- ">=32.0,<33.0" --> pip-requirements-parser
    cyclonedx-bom -- ">=5.1,<6.0" --> chardet
    cyclonedx-bom -- ">=8.0,<12" --> cyclonedx-python-lib
    cyclonedx-python-lib -- ">=0.11,<2" --> packageurl-python
    cyclonedx-python-lib -- ">=2.1.0,<3.0.0" --> py-serializable
    cyclonedx-python-lib -- ">=2.4.0,<3.0.0" --> sortedcontainers
    cyclonedx-python-lib -- ">=30,<31" --> license-expression
    cyclonedx-python-lib -- ">=4.6,<5.0" --> typing-extensions
    dagster -- "<3" --> tomli
    dagster -- "<5" --> tqdm
    dagster -- "==1.9.11" --> dagster-pipes
    dagster -- ">=0.8.3,<6" --> watchdog
    dagster -- ">=1.0" --> toposort
    dagster -- ">=1.0,<3" --> sqlalchemy
    dagster -- ">=1.2.1,!=1.7.0,!=1.6.3,!=1.11.0" --> alembic
    dagster -- ">=1.44.0" --> grpcio
    dagster -- ">=1.44.0" --> grpcio-health-checking
    dagster -- ">=2,<3.0.0" --> pydantic
    dagster -- ">=20.9" --> packaging
    dagster -- ">=4,<6" --> protobuf
    dagster -- ">=4.10.0,<5" --> typing-extensions
    dagster -- ">=5.0" --> click_0
    dagster -- ">=5.1" --> pyyaml
    dagster -- ">=6.1,<=14.0" --> coloredlogs
    dagster -- "any" --> antlr4-python3-runtime
    dagster -- "any" --> docstring-parser
    dagster -- "any" --> filelock
    dagster -- "any" --> jinja2
    dagster -- "any" --> python-dotenv
    dagster -- "any" --> pytz
    dagster -- "any" --> requests
    dagster -- "any" --> rich
    dagster -- "any" --> setuptools
    dagster -- "any" --> six
    dagster -- "any" --> structlog
    dagster -- "any" --> tabulate
    dagster -- "any" --> universal-pathlib
    dagster-postgres -- "==1.9.11" --> dagster
    dagster-postgres -- "any" --> psycopg2-binary
    dependency-groups -- "any" --> packaging
    docker -- ">=1.26.0" --> urllib3
    docker -- ">=2.26.0" --> requests
    docker-compose-graph -- "any" --> graphviz
    docker-compose-graph -- "any" --> jinja2
    docker-compose-graph -- "any" --> pydot
    docker-compose-graph -- "any" --> python-dotenv
    docker-compose-graph -- "any" --> pyyaml
    dotenv -- "any" --> python-dotenv
    gitdb -- ">=3.0.1,<6" --> smmap
    gitpython -- ">=4.0.1,<5" --> gitdb
    grpcio -- "~=4.12" --> typing-extensions
    grpcio-health-checking -- ">=1.71.2" --> grpcio
    grpcio-health-checking -- ">=5.26.1,<6.0dev" --> protobuf
    isoduration -- ">=0.15.0" --> arrow
    jinja2 -- ">=2.0" --> markupsafe
    jsonschema -- ">=0.28.4" --> referencing
    jsonschema -- ">=0.7.1" --> rpds-py
    jsonschema -- ">=2023.03.6" --> jsonschema-specifications
    jsonschema -- ">=22.2.0" --> attrs
    jsonschema-specifications -- ">=0.31.0" --> referencing
    license-expression -- ">=4.0" --> boolean-py
    mako -- ">=0.9.2" --> markupsafe
    markdown-it-py -- "~=0.1" --> mdurl
    nox -- ">=1.1" --> dependency-groups
    nox -- ">=1.9.4,<4" --> argcomplete
    nox -- ">=2.6.1,<7" --> colorlog
    nox -- ">=20.15" --> virtualenv
    nox -- ">=21" --> packaging
    nox -- ">=24.1" --> attrs
    nox -- ">=4" --> humanize
    openstudiolandscapes -- "==1.9.11" --> dagster
    openstudiolandscapes -- "any" --> dagster-postgres
    openstudiolandscapes -- "any" --> docker
    openstudiolandscapes -- "any" --> docker-compose-graph
    openstudiolandscapes -- "any" --> gitpython
    openstudiolandscapes -- "any" --> nox
    openstudiolandscapes -- "any" --> openstudiolandscapesutil-harborcli
    openstudiolandscapes -- "any" --> pydot
    openstudiolandscapes -- "any" --> pyyaml
    openstudiolandscapes -- "any" --> snakemd
    openstudiolandscapes-twingate -- "==1.9.11" --> dagster
    openstudiolandscapes-twingate -- "any" --> docker-compose-graph
    openstudiolandscapes-twingate -- "any" --> gitpython
    openstudiolandscapes-twingate -- "any" --> openstudiolandscapes
    openstudiolandscapes-twingate -- "any" --> pyyaml
    openstudiolandscapes-twingate -- "any" --> snakemd
    openstudiolandscapesutil-harborcli -- "any" --> dotenv
    openstudiolandscapesutil-harborcli -- "any" --> pyyaml
    openstudiolandscapesutil-harborcli -- "any" --> requests
    openstudiolandscapesutil-harborcli -- "any" --> snakemd
    pip-requirements-parser -- "any" --> packaging
    pip-requirements-parser -- "any" --> pyparsing
    pipdeptree -- ">=25" --> packaging
    pipdeptree -- ">=25.2" --> pip
    py-serializable -- ">=0.7.1,<0.8.0" --> defusedxml
    pydantic -- "==2.41.4" --> pydantic-core
    pydantic -- ">=0.4.2" --> typing-inspection
    pydantic -- ">=0.6.0" --> annotated-types
    pydantic -- ">=4.14.1" --> typing-extensions
    pydantic-core -- ">=4.14.1" --> typing-extensions
    pydot -- ">=3.1.0" --> pyparsing
    python-dateutil -- ">=1.5" --> six
    referencing -- ">=0.7.0" --> rpds-py
    referencing -- ">=22.2.0" --> attrs
    referencing -- ">=4.4.0" --> typing-extensions
    requests -- ">=1.21.1,<3" --> urllib3
    requests -- ">=2,<4" --> charset-normalizer
    requests -- ">=2.5,<4" --> idna
    requests -- ">=2017.4.17" --> certifi
    rfc3339-validator -- "any" --> six
    rfc3987-syntax -- ">=1.2.2" --> lark
    rich -- ">=2.13.0,<3.0.0" --> pygments
    rich -- ">=2.2.0" --> markdown-it-py
    sqlalchemy -- ">=1" --> greenlet
    sqlalchemy -- ">=4.6.0" --> typing-extensions
    typing-inspection -- ">=4.12.0" --> typing-extensions
    universal-pathlib -- ">=0.5.1,<0.6.0" --> pathlib-abc
    universal-pathlib -- ">=2024.5.0" --> fsspec
    virtualenv -- ">=0.3.7,<1" --> distlib
    virtualenv -- ">=3.12.2,<4" --> filelock
    virtualenv -- ">=3.9.1,<5" --> platformdirs
